/*var type = [{
    icon: 'fa-solid fa-location-dot',
    name:'แหล่งที่มาปลาสลิด',
    typedata:'knowledge',
    description:'พื้นที่อำเภอบางบ่อ จังหวัดสมุทรปราการ เป็นพื้นที่น้ำกร่อย ซึ่งเป็นเหตุผลหนึ่งที่ทำให้ ปลาสลิดรสชาติดี เพราะปลาสลิดชอบพื้นที่เค็มและน้ำกร่อย ประกอบกับอาหารที่มีอยู่ตามธรรมชาติของ พื้นที่ค่อนข้างสมบรูณ์ ซึ่งพื้นที่ที่อื่นไม่มี คือ หญ้าที่เกิดจากธรรมชาติ ซึ่งเกษตรกรสามารถนำไปเลี้ยงปลา ได้ สอดคล้องกับงานวิจัยของ สมพันธ์ อภิรักส์ และวัฒนีย์ โรจนสัมฤทธิ์ (2557) ที่พบว่า ปลาสลิดบางบ่อ เติบโตในพื้นที่ดินเค็ม น้ำกร่อย มีหญ้าเฉพาะถิ่นซึ่งเป็นอาหารที่ดีของปลาสลิด เช่น หญ้าทรงกระเทียม หญ้าแพรกน้ำเค็มและหญ้าปล้อง เป็นต้น เป็นต้น นอกจากนั้นผลงานวิจัยยังพบว่า เกษตรกรของอำเภอบางบ่อ ส่วนใหญ่จะใช้พื้นที่นาในการเลี้ยงปลาสลิด โดยการขุดเอาดินในนาขึ้นไปทำคันนา ลึกลงไปประมาณ 1-1.50 เมตร บ่อเลี้ยงปลาใส่น้ำประมาณ 60-70 เซนติเมตร และใช้น้ำจากธรรมชาติ ได้แก่ น้ำฝน หรือ น้ำที่มาจากคลองชลประทาน เริ่มต้นในการเตรียมบ่อเลี้ยงต้องล้างโคลนสาดเลน ตากแดดพื้นที่บ่อ ประมาณ 20 วัน จากนั้นจึงนำน้ำใหม่เข้าให้เต็มพื้นที่นาเริ่มต้นความสูงของน้ำประมาณ 40 เซนติเมตร จึงจะสามารถปล่อยพันธุ์ปลาสลิดลงบ่อ สอดคล้องกับ อ. พฤกษ์อำไพ, นามแฝง (2542) ที่พบว่าปลาสลิด ส่วนมากนิยมเลี้ยงในนา',
    web:'http://otop.dss.go.th/index.php/en/knowledge/informationrepack/363-2020-03-03-03-36-37?showall=1&limitstart='
},{
    icon: 'fa-solid fa-fish',
    name:'ลักษณะของปลาสลิด',
    typedata:'knowledge',
    description: 'ปลาสลิดบางบ่อเป็นเอกลักษณ์ประจำถิ่นที่มีชื่อเสียงของจังหวัดสมุทรปราการ เนื่องจาก เนื้อปลาจะแตกต่างจากพื้นที่อื่น ๆ คือ อาศัยอยู่ในน้ำกร่อย เนื้อปลาจะแน่น เนื่องจากเกษตรกรฟันหญ้า ให้ขาดเป็นท่อน ๆ ทำเป็นกองไว้ให้ปลามากินพอหญ้าแห้งก็จะกลับด้านหญ้าขึ้นมาใหม่ จากนั้นก็ทยอย ฟันหญ้าไปเรื่อย ๆ ปลาก็จะทยอยกินไปเรื่อย ๆ จนรอบพื้นที่บ่อเลี้ยง ปลาต้องว่ายน้ำหาอาหารกินเอง และได้กินอาหารธรรมชาติตลอดเวลา สอดคล้องกับงานวิจัยของ ชุติระ ระบอบ และคณะ (2561) ที่พบว่า การเลี้ยงปลาสลิดบางบ่อ คือ การเลี้ยงตามธรรมชาติโดยการฟันหญ้าเป็นอาหารปลา และการ เลี้ยงแบบผสมผสานเพื่อให้ทั้งหญ้าร่วมกับอาหารปลาที่ซื้อมาจากตลาด ทำให้ปลาสลิดที่ได้มีความ แตกต่างกัน กล่าวคือ ปลาสลิดที่เลี้ยงตามธรรมชาติมักจะมีตัวเล็กและมีสีเข้มกว่านอกจากนั้นงานวิจัย พบว่า เนื้อปลาสลิดบางบ่อมีไขมันต่ำ สอดคล้องกับงานวิจัยของ น้ำผึ้ง มีศิล (2561) ที่ศึกษาพบว่า ไขมัน ปลาแทรกอยู่ตามเนื้อปลาแทนการกระจุกตัวอยู่ที่ท้องปลา เนื่องจากไขมันจะสะสมอยู่มากในช่วงฤดู หนาว แต่จากการศึกษาพบว่า เกษตรกรของอำเภอบางบ่อจะจับปลาในช่วงเดือนกันยายน (ก่อนฤดู หนาว) ทำให้ได้ปลาสลิดที่มีไขมันต่ำ อีกทั้งยังพบว่าเนื้อปลาสลิดบางบ่อไม่เหม็นคาว โดยงานวิจัย น้ำผึ้ง มีศิล (2561) ยังศึกษาพบว่า สาเหตุที่ปลาสลิดจังหวัดสมุทรปราการไม่เหม็นคาว เนื่องจากสภาพน้ำที่เดิม เป็นดินเค็มหรือดินทะเลเก่า ซึ่งลักษณะของแร่ธาตุที่เหมาะสมช่วยในการดับกลิ่นสาปของปลาสลิดได้เป็น อย่างดีดังนั้น เอกลักษณ์ของคำว่า “ปลาสลิดบางบ่อ” คือ วิธีการเลี้ยงปลาสลิดที่ทำให้เนื้อปลาแน่น ไขมันน้อย ไม่เหม็นคาวและรสชาติดี สอดคล้องกับงานวิจัยของ สัมพันธ์ อภิรักส์ และวัฒนีย์ โรจนสัมฤทธิ์ (2557) ที่พบว่า ปลาสลิดบางบ่อมีลักษณะพิเศษเฉพาะ คือ ลำตัวแบน สีดำเข้ม มีลายเสือหรือลาย แตงไทย ไขมันแทรกพอเหมาะ เนื้อแน่นเหนียว และรสชาติดี และสอดคล้องกับงานวิจัยของ พิมสิริ ภู่ตระกูล และคณะ (2561) ปลาสลิดบางบ่อจะมีเนื้อแน่นกว่าปลาสลิดจากที่อื่นและมีรสชาติที่อร่อยกว่า รวมทั้งมีมันแทรกอยู่ตามเนื้อปลา แตกต่างจากปลาสลิดจากที่อื่น',
    web: 'https://eto.ku.ac.th/neweto/e-book/fish/f_salid.pdf'
},{
    icon: 'fa-solid fa-kitchen-set',
    name:'การแปรรูปปลาสลิด',
    typedata:'knowledge',
    description: 'การแปรรูปให้เป็นปลาสลิดตากแห้ง จากภูมิปัญญาของท้องถิ่นปัจจุบันเน้นการใส่เกลือให้ เค็มจัดไว้ก่อน สังเกตปลาที่เค็มจะจมลงไปหมดเลย พอปลาเริ่มจืดมันจะลอยขึ้นมาจำนวนมาก จากนั้นนำ ปลาไปแช่น้ำ และล้างตากได้ สอดคล้องกับ ส. พุ่มสุวรรณ, นามแฝง (2544); อ. พฤกษ์อำไพ, นามแฝง (2542) ที่กล่าวว่า ปลาสลิดไม่นิยมบริโภคสด แต่จะนำมาแปรรูปเป็นปลาเค็มตากแห้ง งานวิจัยของ ขวัญใจ อุณหวัฒนไพบูลย์ (2557) ที่ศึกษาพบว่า การพัฒนาชุมชนให้เข้มแข็งควรเริ่มจากภูมิปัญญาท้องถิ่น ซึ่ง อาชีพเลี้ยงปลาสลิดมีการนำปลาสลิดสดมาแปรรูปก่อนแล้วจึงส่งขาย งานวิจัยของ น้ำผึ้ง มีศิล (2561) ที่พบว่า การตากปลาสลิดแห้งของชาวจังหวัดสมุทรปราการจะมีวิธีการตากปลาที่ช่วยให้ปลาแห้งเร็วและ ดูน่ารับประทาน และสอดคล้องกับงานวิจัยของ สมพันธ์ อภิรักส์ และวัฒนีย์ โรจนสัมฤทธิ์ (2557) ที่พบว่า ปลาสลิดบางบ่อนิยมแปรรูปเป็นปลาสลิดแดดเดียว ปลาสลิดหอม ปลาสลิดอบกรอบ ปลาสลิด ทอดไร้ก้าง และน้ำพริกปลาสลิด เป็นต้นและงานวิจัยของ พรรณราย แสงวิเชียร และคณะ (2561) ได้นำ ก้างปลาสลิดนำมาแปรรูปเป็น ทองม้วนก้างปลาสลิดไฮแคลเซียมของดีบางบ่อ',
    web: 'https://cookpad.com/th/search/%E0%B8%9B%E0%B8%A5%E0%B8%B2%E0%B8%AA%E0%B8%A5%E0%B8%B4%E0%B8%94?event=search.typed_query'
},{
    icon: 'fa-solid fa-fish-fins',
    name:'ปัญหาในการเลี้ยงปลาสลิด',
    typedata: 'knowledge',
    description: '1) เกษตรกรบางรายพบปัญหาการขาดแคลนเงินทุน เช่น การซื้อน้ำมันมาเติมเครื่องสูบน้ำ เข้าบ่อในขณะที่เกษตรกรบางรายแก้ปัญหา โดยลงทุนครั้งเดียวเพื่อวางท่อส่งน้ำ และการลงทุนซื้อลูกปลา มาปล่อยลงบ่อเลี้ยง เนื่องจากเกษตรกรบางรายขยายพันธุ์ปลาได้ลูกปลาจำนวนน้อย สอดคล้องกับ งานวิจัยของ ชุติระ ระบอบ และคณะ (2561) ที่พบว่า ปัญหาและอุปสรรคหนึ่งที่สำคัญของการเลี้ยงปลา สลิดบางบ่อคือ ปัญหาการเพาะพันธุ์ลูกปลา อาจเป็นไปได้ว่าพ่อพันธุ์แม่พันธุ์ไม่สมบูรณ์ หรือเลือดชิด หรืออาจเกิดจากการการอนุบาลลูกปลาในช่วงแรกเกิดยังไม่ดีพอทำให้ได้จำนวนลูกปลาที่รอดไม่เป็นไป ตามเป้าหมายที่ตั้งไว้ จึงต้องใช้เงินลงทุนซื้อลูกปลามาเพิ่ม และสอดคล้องกับงานวิจัยของ ศรัญญ์ทิตา ชนะชัยภูวพัฒน์ (2562) ที่พบว่า ผู้ประกอบการส่วนใหญ่ไม่มีเงินทุนเพียงพอ <br> 2) เกษตรกรบางรายพบปัญหาน้ำ ได้แก่ ปัญหาการขาดแคลนน้ำในช่วงปีที่เกิดอุทกภัยใน กรุงเทพฯ ซึ่งต้องมีการปล่อยน้ำลงทะเลทำให้เกิดปัญหาการขาดแคลนน้ำเพื่อการเกษตรและประมง และ ปัญหาน้ำเสียจากโรงงานอุตสาหกรรม สอดคล้องกับงานวิจัยของ ชุติระ ระบอบ และคณะ(2561) ที่พบว่า ปัญหาและอุปสรรคอีกประการหนึ่งที่สำคัญของการเลี้ยงปลาสลิดบางบ่อ คือ ปัญหาคุณภาพน้ำ สะท้อนให้เห็นว่า จังหวัดสมุทรปราการควรขุดลอกคลองชลประทานอย่างน้อยปีละครั้ง เพื่อทำให้น้ำใน คลองชลประทานสะอาด ไม่มีสารพิษ หรือสารเคมีตกค้าง <br> 3) เกษตรกรยังขาดองค์ความรู้จากภาครัฐที่จะมาให้ความรู้เกี่ยวกับมาตรฐานการเลี้ยงปลา สลิดและมาตรฐานการแปรรูป สอดคล้องกับงานวิจัยของ ศรัญญ์ทิตา ชนะชัยภูวพัฒน์(2562) ที่พบว่า ผู้ประกอบการส่วนใหญ่ขาดพื้นฐานความเข้าใจเกี่ยวกับมาตรฐานต่าง ๆ',
    web: 'https://www4.fisheries.go.th/local/file_document/20180417114236_1_file.pdf'
},{
    icon: 'fa-solid fa-baby-carriage',
    name:'การเพาะเลี้ยงปลาสลิด',
    typedata: 'knowledge',
    description: 'การเลี้ยงปลาสลิดและการขยายพันธุ์ปลาสลิดทำได้ 2 วิธี คือ 1) การนำลูกปลาสลิดมา ปล่อยและเลี้ยงโดยธรรมชาติ และ 2) การเลี้ยงด้วยพ่อพันธุ์แม่พันธุ์ที่สมบูรณ์ แล้วปล่อยตามธรรมชาติ ซึ่งลักษณะพ่อพันธุ์แม่พันธุ์ที่จะเก็บไว้มาขยายพันธุ์ อย่างน้อยต้องมีอายุ 10 เดือนขึ้นไป เพื่อให้ลูกปลา ที่สมบูรณ์เจริญเติบโตได้เร็วและพร้อมที่จะขยายพันธุ์พันธุ์ต่อไป ควรใช้พ่อพันธุ์แม่พันธุ์ประมาณ 40 ตัว ต่อไร่ ซึ่งพ่อพันธุ์ 2 ตัว ต่อแม่พันธุ์ 1 ตัว และภายใน 3 ปี ต้องเปลี่ยนพ่อพันธุ์ เพื่อไม่ให้ปลาเลือดชิด เพราะลูกปลาจะเจริญเติบโตได้ไม่ดี การเลี้ยงให้ได้ผลดีคือการอนุบาลลูกปลาให้รอดมากที่สุด ซึ่งเทคนิค ให้ลูกปลาสลิดแรกเกิดมา 24 ชั่วโมงมีเปอร์เซ็นต์การอยู่รอดสูง คือ การนำน้ำมันจากไส้ที่เคี่ยวไว้ ไปใส่ ข้าง ๆ ที่ลูกปลาอยู่เพื่อให้ลูกปลาทุกตัวได้กิน ประกอบการฟันหญ้า จากนั้นเมื่อลูกปลาโตได้ประมาณ 7 วัน-1 เดือน สภาพน้ำจะเปลี่ยนเป็นสีชาอ่อน ๆ น้ำจะมีรสหวาน และหน้าน้ำต้องเปิดเพื่อให้แดดส่องถึง พื้น ไม่ควรมีแหนเยอะ เพราะเชื้อโรคจะเกิดขึ้นได้สอดคล้องกับงานวิจัยของ ชุติระ ระบอบ และคณะ (2561) ที่พบว่า เทคนิคการเลี้ยงปลาสลิดตกทอดมาจนถึงครอบครัวรุ่นปัจจุบัน โดยการเลี้ยงด้วยวิธี ธรรมชาติ ซึ่งอาหารของปลา คือ การฟันหญ้าที่ขึ้นรอบบ่อปลาและใช้เวลาประมาณ 7 วัน น้ำจะเริ่ม เปลี่ยนเป็นสีชา ซึ่งเป็นช่วงที่ผู้เลี้ยงต้องเอาใจใส่และดูแลเป็นพิเศษเพื่อให้ได้ผลผลิตที่มีคุณภาพและตรง กับความต้องการจากนั้น 1 เดือน น้ำจะเป็นสีชาเข้มขึ้น คือ เพิ่มความหวานในน้ำขึ้นมาอีก โดยการฟัน หญ้าที่เราทำเป็นอาหารเลี้ยงปลาแล้วเก็บเอาเป็นกอง แล้วเอาหญ้าไว้ในน้ำเพื่อเปลี่ยนน้ำรสกร่อยรส เปรี้ยวให้น้ำมีรสหวาน ซึ่งภายใน 24 ชั่วโมงน้ำตรงนั้นจะเปลี่ยนรสชาติ เมื่อเลี้ยงไปประมาณ 2-3 เดือน แล้ว น้ำจะเปลี่ยนเป็นสีชาเข้มขึ้น ลูกปลาช่วงนี้จะโตเร็ว ปลาสลิดจะเลี้ยงจนกระทั่งอายุประมาณ 7-8 เดือน จึงจะจับขาย สอดคล้องกับ ส. พุ่มสุวรรณ, นามแฝง (2544) ที่กล่าวว่า ปลาสลิดเป็นปลาปาก เล็ก กินอาหารจำพวกพืชและสัตว์เล็ก ๆ ในน้ำ รวมทั้งหญ้าหมักที่เน่าเปื่อย ดังนั้นระยะเวลาการเลี้ยงจึง ค่อนข้างนาน ซึ่งอาจต้องเลี้ยงถึง 8 เดือนขึ้นไป และไชยา อุ้ยสูงเนิน (2541) กล่าวว่า บ่อที่ใช้เพาะพันธุ์ ปลาสลิดควรมีหญ้าหรือพันธุ์ไม้น้ำอื่น ๆ ขึ้นตามริมขอบบ่อถ้าฟันหญ้าลงบ่อทุกสัปดาห์จะดี เพราะปลา สลิดชอบกินหญ้าเน่ามาก นอกจากนั้นยังพบว่ามีศัตรูของลูกปลาสลิด เช่น แม่ปลาสลิดซึ่งมักกินไข่ตนเอง ตัวจิงโจ้น้ำที่มีขาเดินตามผิวน้ำกลางคืนจะจับตัวลูกปลาเพื่อกินเลือด และนกต่าง ๆ ที่จะมากินลูกปลา เป็นต้น สอดคล้องกับงานวิจัยของ ชุติระ ระบอบ และคณะ (2561) ที่พบว่า ปัญหาที่เกิดจากสัตว์อื่นทำ ให้การเจริญพันธุ์ของลูกปลาลดลง ได้แก่ นก และตะกวด',
    web: 'https://www4.fisheries.go.th/local/file_document/20210416135909_1_file.pdf'
},{
    icon: 'fa-solid fa-cart-shopping',
    name:'ร้านค้าปลาสลิด',
    typedata: 'map',
    description: 'สามารถดูแผนที่ร้านค้าต่างๆที่เกี่ยวกับปลาสลิดของจังหวัดสมุทรปราการได้ที่ปุ่ม "web" ได้เลย',
    web: 'https://www.google.co.th/maps/search/%E0%B8%A3%E0%B9%89%E0%B8%B2%E0%B8%99%E0%B8%9B%E0%B8%A5%E0%B8%B2%E0%B8%AA%E0%B8%A5%E0%B8%B4%E0%B8%94%E0%B9%83%E0%B8%99%E0%B8%AA%E0%B8%A1%E0%B8%B8%E0%B8%97%E0%B8%A3%E0%B8%9B%E0%B8%A3%E0%B8%B2%E0%B8%81%E0%B8%B2%E0%B8%A3/@13.5686516,100.8129716,13z?hl=th&entry=ttu'
},{
    icon: 'fa-solid fa-book',
    name:'งานวิจัย KM ปลาสลิด',
    typedata: 'research',
    description: 'สามารถดูงานวิจัยที่เกี่ยวกับปลาสลิด ได้ที่ปุ่ม "web" ได้เลย',
    web: 'https://so02.tci-thaijo.org/index.php/human_dru/article/view/251598/169489'
},{
    icon: 'fa-solid fa-book',
    name:'OTOP การทำปลาสลิดบางบ่อ',
    typedata: 'research',
    description: 'สามารถดูงานวิจัยที่เกี่ยวกับปลาสลิด ได้ที่ปุ่ม "web" ได้เลย',
    web: 'https://www.kpi-lib.com/elib/cgi-bin/opacexe.exe?op=mmvw&db=Main&sid=&skin=s&usid=&mmid=8950&bid=25859&lang=1'
},{
    icon: 'fa-solid fa-book',
    name:'การเลี้ยงปลาสลิดบางบ่อ',
    typedata: 'research',
    description: 'สามารถดูงานวิจัยที่เกี่ยวกับปลาสลิด ได้ที่ปุ่ม "web" ได้เลย',
    web: 'http://sci-database.hcu.ac.th/science/file/rspjID76_F1_20200621181112.pdf'
}];
*/

var type;

$(document).ready(()=>{

    $.ajax({
        method: 'get',
        url: './api/getallproduct.php',
        success: function (response) {
            console.log(response)
            if (response.RespCode == 200) {

                type = response.Result;

                var html = '';
                for (let i = 0; i < type.length; i++) {
                    html += `<div onclick="openProductDetail(${i})" class="selectData ${type[i].typedata}">
                                <i class="${type[i].icon}" ></i>
                                <p style="font-size: 1.5vw;">${type[i].name}</p>
                            </div>`;
                }
                $('#conjs').html(html);
            }
        }, error: function (err) {
            console.log(err)
        }
    })
})

function search(text) {
    var value = $('#'+text.id).val();
    console.log(value);

    var html = '';
    for(let i=0;i<type.length;i++) {
        if(type[i].name.includes(value)){
            html += `<div onclick="openProductDetail(${i})" class="selectData ${type[i].typedata}">
        <i class="${type[i].icon}" "></i>
        <p style="font-size: 1.5vw;">${type[i].name}</p>
    </div>`;
        }
    }
    $('#conjs').html(html);
}

function searchdata(data) {
    console.log(data);
    $(".selectData").css('display','none')
    if(data == 'All'){
        $(".selectData").css('display','block')
    }
    else{
        $("."+data).css('display','block')
    }
}

var productindex = 0;
function openProductDetail(index) {
    productindex = index;
    console.log(productindex)
    $("#modalDesc").css('display', 'flex')
    var html = '';

        html += `<div onclick="closeModal()" class="modal-bg"></div>
        <div class="modal-page">
            <br>
            <div class="modaldesc-content">
                <div class="modaldesc-detail">
                    <p id="mdd-name" style="font-size: 2vw;" class="modal-font">${type[index].name}</p>
                    <p id="mdd-type" style="font-size: 1.2vw;" class="modal-font">${type[index].typedata}</p>
                    <br>
                    <p id="mdd-desc" style="font-size: 1.2vw;" class="modal-font">${type[index].description}</p>
                    <br>
                    <div class="btn-control">
                        <button onclick="closeModal()" class="btn">
                            Close
                        </button>
                        <a href="${type[index].web}" class="btn btn-buy">web</a>
                    </div>
                </div>
            </div>
        </div>`;

    $('#modalDesc').html(html);
}

function closeModal() {
    $(".modal").css('display', 'none')
}
